__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 32)           0                                            
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 32, 512)      16384       input_2[0][0]                    
__________________________________________________________________________________________________
dot_1 (Dot)                     (None, 32, 32)       0           embedding_2[0][0]                
                                                                 embedding_2[0][0]                
__________________________________________________________________________________________________
softmax_1 (Softmax)             (None, 32, 32)       0           dot_1[0][0]                      
__________________________________________________________________________________________________
dot_2 (Dot)                     (None, 32, 512)      0           softmax_1[0][0]                  
                                                                 embedding_2[0][0]                
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 512)      0           embedding_2[0][0]                
                                                                 dot_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 512)      2048        add_1[0][0]                      
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 32, 2048)     1050624     batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 32, 512)      1049088     conv1d_1[0][0]                   
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 32)           0                                            
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 512)      0           conv1d_2[0][0]                   
                                                                 batch_normalization_1[0][0]      
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 32, 512)      16384       input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 512)      2048        add_2[0][0]                      
__________________________________________________________________________________________________
dot_3 (Dot)                     (None, 32, 32)       0           embedding_1[0][0]                
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
softmax_2 (Softmax)             (None, 32, 32)       0           dot_3[0][0]                      
__________________________________________________________________________________________________
dot_4 (Dot)                     (None, 32, 512)      0           softmax_2[0][0]                  
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 512)      0           embedding_1[0][0]                
                                                                 dot_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 512)      2048        add_3[0][0]                      
__________________________________________________________________________________________________
dot_5 (Dot)                     (None, 32, 32)       0           batch_normalization_3[0][0]      
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dot_7 (Dot)                     (None, 32, 32)       0           batch_normalization_2[0][0]      
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
softmax_3 (Softmax)             (None, 32, 32)       0           dot_5[0][0]                      
__________________________________________________________________________________________________
softmax_4 (Softmax)             (None, 32, 32)       0           dot_7[0][0]                      
__________________________________________________________________________________________________
dot_6 (Dot)                     (None, 32, 512)      0           softmax_3[0][0]                  
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dot_8 (Dot)                     (None, 32, 512)      0           softmax_4[0][0]                  
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 512)      0           batch_normalization_3[0][0]      
                                                                 dot_6[0][0]                      
__________________________________________________________________________________________________
add_6 (Add)                     (None, 32, 512)      0           batch_normalization_2[0][0]      
                                                                 dot_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 512)      2048        add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 512)      2048        add_6[0][0]                      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 32, 2048)     1050624     batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 32, 2048)     1050624     batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 32, 512)      1049088     conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 32, 512)      1049088     conv1d_5[0][0]                   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 32, 512)      0           conv1d_4[0][0]                   
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
add_7 (Add)                     (None, 32, 512)      0           conv1d_6[0][0]                   
                                                                 batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 512)      2048        add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 512)      2048        add_7[0][0]                      
__________________________________________________________________________________________________
dot_9 (Dot)                     (None, 32, 32)       0           batch_normalization_5[0][0]      
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
softmax_5 (Softmax)             (None, 32, 32)       0           dot_9[0][0]                      
__________________________________________________________________________________________________
dot_10 (Dot)                    (None, 32, 512)      0           softmax_5[0][0]                  
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
add_8 (Add)                     (None, 32, 512)      0           batch_normalization_5[0][0]      
                                                                 dot_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 512)      2048        add_8[0][0]                      
__________________________________________________________________________________________________
dot_11 (Dot)                    (None, 32, 32)       0           batch_normalization_8[0][0]      
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dot_13 (Dot)                    (None, 32, 32)       0           batch_normalization_7[0][0]      
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
softmax_6 (Softmax)             (None, 32, 32)       0           dot_11[0][0]                     
__________________________________________________________________________________________________
softmax_7 (Softmax)             (None, 32, 32)       0           dot_13[0][0]                     
__________________________________________________________________________________________________
dot_12 (Dot)                    (None, 32, 512)      0           softmax_6[0][0]                  
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dot_14 (Dot)                    (None, 32, 512)      0           softmax_7[0][0]                  
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
add_9 (Add)                     (None, 32, 512)      0           batch_normalization_8[0][0]      
                                                                 dot_12[0][0]                     
__________________________________________________________________________________________________
add_11 (Add)                    (None, 32, 512)      0           batch_normalization_7[0][0]      
                                                                 dot_14[0][0]                     
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 512)      2048        add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32, 512)      2048        add_11[0][0]                     
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 32, 2048)     1050624     batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 32, 2048)     1050624     batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 32, 512)      1049088     conv1d_7[0][0]                   
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 32, 512)      1049088     conv1d_9[0][0]                   
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 512)      0           conv1d_8[0][0]                   
                                                                 batch_normalization_9[0][0]      
__________________________________________________________________________________________________
add_12 (Add)                    (None, 32, 512)      0           conv1d_10[0][0]                  
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 512)      2048        add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 32, 512)      2048        add_12[0][0]                     
__________________________________________________________________________________________________
dot_15 (Dot)                    (None, 32, 32)       0           batch_normalization_10[0][0]     
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
softmax_8 (Softmax)             (None, 32, 32)       0           dot_15[0][0]                     
__________________________________________________________________________________________________
dot_16 (Dot)                    (None, 32, 512)      0           softmax_8[0][0]                  
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
add_13 (Add)                    (None, 32, 512)      0           batch_normalization_10[0][0]     
                                                                 dot_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 512)      2048        add_13[0][0]                     
__________________________________________________________________________________________________
dot_17 (Dot)                    (None, 32, 32)       0           batch_normalization_13[0][0]     
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
dot_19 (Dot)                    (None, 32, 32)       0           batch_normalization_12[0][0]     
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
softmax_9 (Softmax)             (None, 32, 32)       0           dot_17[0][0]                     
__________________________________________________________________________________________________
softmax_10 (Softmax)            (None, 32, 32)       0           dot_19[0][0]                     
__________________________________________________________________________________________________
dot_18 (Dot)                    (None, 32, 512)      0           softmax_9[0][0]                  
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
dot_20 (Dot)                    (None, 32, 512)      0           softmax_10[0][0]                 
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
add_14 (Add)                    (None, 32, 512)      0           batch_normalization_13[0][0]     
                                                                 dot_18[0][0]                     
__________________________________________________________________________________________________
add_16 (Add)                    (None, 32, 512)      0           batch_normalization_12[0][0]     
                                                                 dot_20[0][0]                     
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 512)      2048        add_14[0][0]                     
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 32, 512)      2048        add_16[0][0]                     
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 32, 2048)     1050624     batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 32, 2048)     1050624     batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 32, 512)      1049088     conv1d_11[0][0]                  
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 32, 512)      1049088     conv1d_13[0][0]                  
__________________________________________________________________________________________________
add_15 (Add)                    (None, 32, 512)      0           conv1d_12[0][0]                  
                                                                 batch_normalization_14[0][0]     
__________________________________________________________________________________________________
add_17 (Add)                    (None, 32, 512)      0           conv1d_14[0][0]                  
                                                                 batch_normalization_16[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 512)      2048        add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 32, 512)      2048        add_17[0][0]                     
__________________________________________________________________________________________________
dot_21 (Dot)                    (None, 32, 32)       0           batch_normalization_15[0][0]     
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
softmax_11 (Softmax)            (None, 32, 32)       0           dot_21[0][0]                     
__________________________________________________________________________________________________
dot_22 (Dot)                    (None, 32, 512)      0           softmax_11[0][0]                 
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
add_18 (Add)                    (None, 32, 512)      0           batch_normalization_15[0][0]     
                                                                 dot_22[0][0]                     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 32, 512)      2048        add_18[0][0]                     
__________________________________________________________________________________________________
dot_23 (Dot)                    (None, 32, 32)       0           batch_normalization_18[0][0]     
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
dot_25 (Dot)                    (None, 32, 32)       0           batch_normalization_17[0][0]     
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
softmax_12 (Softmax)            (None, 32, 32)       0           dot_23[0][0]                     
__________________________________________________________________________________________________
softmax_13 (Softmax)            (None, 32, 32)       0           dot_25[0][0]                     
__________________________________________________________________________________________________
dot_24 (Dot)                    (None, 32, 512)      0           softmax_12[0][0]                 
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
dot_26 (Dot)                    (None, 32, 512)      0           softmax_13[0][0]                 
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
add_19 (Add)                    (None, 32, 512)      0           batch_normalization_18[0][0]     
                                                                 dot_24[0][0]                     
__________________________________________________________________________________________________
add_21 (Add)                    (None, 32, 512)      0           batch_normalization_17[0][0]     
                                                                 dot_26[0][0]                     
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 32, 512)      2048        add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 32, 512)      2048        add_21[0][0]                     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 32, 2048)     1050624     batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 32, 2048)     1050624     batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 32, 512)      1049088     conv1d_15[0][0]                  
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 32, 512)      1049088     conv1d_17[0][0]                  
__________________________________________________________________________________________________
add_20 (Add)                    (None, 32, 512)      0           conv1d_16[0][0]                  
                                                                 batch_normalization_19[0][0]     
__________________________________________________________________________________________________
add_22 (Add)                    (None, 32, 512)      0           conv1d_18[0][0]                  
                                                                 batch_normalization_21[0][0]     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 32, 512)      2048        add_20[0][0]                     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 32, 512)      2048        add_22[0][0]                     
__________________________________________________________________________________________________
dot_27 (Dot)                    (None, 32, 32)       0           batch_normalization_20[0][0]     
                                                                 batch_normalization_22[0][0]     
__________________________________________________________________________________________________
softmax_14 (Softmax)            (None, 32, 32)       0           dot_27[0][0]                     
__________________________________________________________________________________________________
dot_28 (Dot)                    (None, 32, 512)      0           softmax_14[0][0]                 
                                                                 batch_normalization_22[0][0]     
__________________________________________________________________________________________________
add_23 (Add)                    (None, 32, 512)      0           batch_normalization_20[0][0]     
                                                                 dot_28[0][0]                     
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 32, 512)      2048        add_23[0][0]                     
__________________________________________________________________________________________________
dot_29 (Dot)                    (None, 32, 32)       0           batch_normalization_23[0][0]     
                                                                 batch_normalization_22[0][0]     
__________________________________________________________________________________________________
dot_31 (Dot)                    (None, 32, 32)       0           batch_normalization_22[0][0]     
                                                                 batch_normalization_22[0][0]     
__________________________________________________________________________________________________
softmax_15 (Softmax)            (None, 32, 32)       0           dot_29[0][0]                     
__________________________________________________________________________________________________
softmax_16 (Softmax)            (None, 32, 32)       0           dot_31[0][0]                     
__________________________________________________________________________________________________
dot_30 (Dot)                    (None, 32, 512)      0           softmax_15[0][0]                 
                                                                 batch_normalization_22[0][0]     
__________________________________________________________________________________________________
dot_32 (Dot)                    (None, 32, 512)      0           softmax_16[0][0]                 
                                                                 batch_normalization_22[0][0]     
__________________________________________________________________________________________________
add_24 (Add)                    (None, 32, 512)      0           batch_normalization_23[0][0]     
                                                                 dot_30[0][0]                     
__________________________________________________________________________________________________
add_26 (Add)                    (None, 32, 512)      0           batch_normalization_22[0][0]     
                                                                 dot_32[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 32, 512)      2048        add_24[0][0]                     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 32, 512)      2048        add_26[0][0]                     
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 32, 2048)     1050624     batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 32, 2048)     1050624     batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 32, 512)      1049088     conv1d_19[0][0]                  
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 32, 512)      1049088     conv1d_21[0][0]                  
__________________________________________________________________________________________________
add_25 (Add)                    (None, 32, 512)      0           conv1d_20[0][0]                  
                                                                 batch_normalization_24[0][0]     
__________________________________________________________________________________________________
add_27 (Add)                    (None, 32, 512)      0           conv1d_22[0][0]                  
                                                                 batch_normalization_26[0][0]     
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 32, 512)      2048        add_25[0][0]                     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 32, 512)      2048        add_27[0][0]                     
__________________________________________________________________________________________________
dot_33 (Dot)                    (None, 32, 32)       0           batch_normalization_25[0][0]     
                                                                 batch_normalization_27[0][0]     
__________________________________________________________________________________________________
softmax_17 (Softmax)            (None, 32, 32)       0           dot_33[0][0]                     
__________________________________________________________________________________________________
dot_34 (Dot)                    (None, 32, 512)      0           softmax_17[0][0]                 
                                                                 batch_normalization_27[0][0]     
__________________________________________________________________________________________________
add_28 (Add)                    (None, 32, 512)      0           batch_normalization_25[0][0]     
                                                                 dot_34[0][0]                     
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 32, 512)      2048        add_28[0][0]                     
__________________________________________________________________________________________________
dot_35 (Dot)                    (None, 32, 32)       0           batch_normalization_28[0][0]     
                                                                 batch_normalization_27[0][0]     
__________________________________________________________________________________________________
softmax_18 (Softmax)            (None, 32, 32)       0           dot_35[0][0]                     
__________________________________________________________________________________________________
dot_36 (Dot)                    (None, 32, 512)      0           softmax_18[0][0]                 
                                                                 batch_normalization_27[0][0]     
__________________________________________________________________________________________________
add_29 (Add)                    (None, 32, 512)      0           batch_normalization_28[0][0]     
                                                                 dot_36[0][0]                     
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 32, 512)      2048        add_29[0][0]                     
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 32, 2048)     1050624     batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 32, 512)      1049088     conv1d_23[0][0]                  
__________________________________________________________________________________________________
add_30 (Add)                    (None, 32, 512)      0           conv1d_24[0][0]                  
                                                                 batch_normalization_29[0][0]     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 32, 512)      2048        add_30[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32, 512)      262656      batch_normalization_30[0][0]     
__________________________________________________________________________________________________
softmax_19 (Softmax)            (None, 32, 512)      0           dense_1[0][0]                    
==================================================================================================
Total params: 25,553,408
Trainable params: 25,522,688
Non-trainable params: 30,720
__________________________________________________________________________________________________
