_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 20, 128, 128, 3)   0         
_________________________________________________________________
average_pooling3d_1 (Average (None, 20, 42, 42, 3)     0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 20, 42, 42, 64)    1792      
_________________________________________________________________
batch_normalization_1 (Batch (None, 20, 42, 42, 64)    256       
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 20, 42, 42, 48)    27696     
_________________________________________________________________
batch_normalization_2 (Batch (None, 20, 42, 42, 48)    192       
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 20, 14, 14, 48)    0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 20, 14, 14, 48)    0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 20, 14, 14, 32)    13856     
_________________________________________________________________
batch_normalization_3 (Batch (None, 20, 14, 14, 32)    128       
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 20, 4, 4, 32)      0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 20, 4, 4, 32)      0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 20, 512)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 20, 256)           787456    
_________________________________________________________________
lstm_2 (LSTM)                (None, 512)               1574912   
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               131328    
_________________________________________________________________
batch_normalization_4 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_4 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               65792     
_________________________________________________________________
batch_normalization_5 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 257       
=================================================================
Total params: 2,605,713
Trainable params: 2,604,401
Non-trainable params: 1,312
_________________________________________________________________
